# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [41]:
#Your code here
import pandas as pd
import sqlite3 

conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

cur.execute('SELECT * FROM employees')

employees = [description[0] for description in cur.description]

In [40]:
cur.execute("SELECT name FROM sqlite_master WHERE type='table';")
cur.fetchall()

[('orderdetails',),
 ('payments',),
 ('offices',),
 ('customers',),
 ('orders',),
 ('productlines',),
 ('products',),
 ('employees',)]

In [42]:
employees
#offices

['employeeNumber',
 'lastName',
 'firstName',
 'extension',
 'email',
 'officeCode',
 'reportsTo',
 'jobTitle']

In [57]:
cur.execute('SELECT officeCode, city FROM offices;').fetchall()

#offices = [description[0] for description in cur.description]
#officeCode = [description[0] for description in cur.description]

[('1', 'San Francisco'),
 ('2', 'Boston'),
 ('3', 'NYC'),
 ('4', 'Paris'),
 ('5', 'Tokyo'),
 ('6', 'Sydney'),
 ('7', 'London')]

In [48]:
offices

['officeCode',
 'city',
 'phone',
 'addressLine1',
 'addressLine2',
 'state',
 'country',
 'postalCode',
 'territory']

In [86]:
cur.execute('''SELECT * FROM customers;''')
customers = [description[0] for description in cur.description]

In [87]:
customers

['customerNumber',
 'customerName',
 'contactLastName',
 'contactFirstName',
 'phone',
 'addressLine1',
 'addressLine2',
 'city',
 'state',
 'postalCode',
 'country',
 'salesRepEmployeeNumber',
 'creditLimit']

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [59]:
#Your code here
cur.execute('''SELECT employeeNumber, lastName, firstName FROM employees JOIN 
    offices USING(officeCode) WHERE officeCode == '2' ''').fetchall()

[('1188', 'Firrelli', 'Julie'), ('1216', 'Patterson', 'Steve')]

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [66]:
#Your code here
cur.execute("""SELECT city, COUNT(*) FROM employees 
LEFT JOIN offices USING(officeCode) GROUP BY 1""").fetchall()

[('Boston', 2),
 ('London', 2),
 ('NYC', 2),
 ('Paris', 5),
 ('San Francisco', 6),
 ('Sydney', 4),
 ('Tokyo', 2)]

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [88]:
# Your code here
cur.execute("""select firstName, lastName,
                      productName
                      from employees e
                      join
                      customers c
                      on e.employeeNumber = c.salesRepEmployeeNumber
                      join orders o
                      using(customerNumber)
                      join orderdetails od
                      using(orderNumber)
                      join products p
                      using(productCode)""")
df = pd.DataFrame(cur.fetchall())
print(len(df))
df.head()

2996

        0         1                                            2
0  Leslie  Jennings                               1958 Setra Bus
1  Leslie  Jennings                       1940 Ford Pickup Truck
2  Leslie  Jennings                      1939 Cadillac Limousine
3  Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4  Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each employee has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!